# Tap useful formulae
tap 'brewsci/bio'
tap 'heroku/brew'

# Install GUI apps
cask '1password'
cask 'bbedit'
cask 'chromium'
cask 'claude'
cask 'claude-code'
cask 'docker-desktop'
cask 'dropbox'
cask 'fantastical'
cask 'figtree'
cask 'gitkraken'
cask 'google-chrome'
cask 'kaleidoscope@2'
cask 'launchbar'
cask 'microsoft-excel'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'signal'
cask 'sketch'
cask 'slack'
cask 'transmit'
cask 'vlc'
cask 'zed'
cask 'zoom'

# Install ruby formulae
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'

# Install python formulae
brew 'gcc'
brew 'python@3.11'
brew 'zmq'
brew 'cython'
brew 'numpy'
brew 'scipy'

# Install node formulae
brew 'npm'

# Install java formulae
brew 'openjdk@11'

# Install science formulae
brew 'mafft'
brew 'fasttree'
brew 'iqtree2'
brew 'iqtree3'

# Install latex formulae
cask 'mactex'
brew 'aspell'

# Install other formulae
brew 'awscli'
brew 'gh'
brew 'git-lfs'
brew 'heroku'
brew 'rethinkdb'
brew 'rothgar/tap/tsv-utils'
