# Tap useful formulae
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install GUI apps
cask 'atom'
cask 'dropbox'
cask 'geneious'
cask 'gitkraken'
cask 'google-chrome'
cask 'kaleidoscope'
cask 'launchbar'
cask 'skype'
cask 'slack'
cask 'transmit'
cask 'vlc'
cask './formula/bbedit.rb'
cask 'figtree'

# Install java
cask 'java'

# Install ruby formulae
brew 'rbenv'
brew 'ruby-build'

# Install python formulae
brew 'gcc'
brew 'python'
brew 'zmq'

# Install node formulae
brew 'npm'

# Install science formulae
brew 'beast'
brew 'beagle'
brew 'raxml'
brew 'mafft'
brew 'fasttree'
brew 'gcc49'

# Install latex formulae
cask 'mactex'
brew 'aspell', args: ['--with-lang-en']

# Install other formulae
brew 'heroku-toolbelt'
brew 'ec2-api-tools'
brew 'rethinkdb'
