# Tap useful formulae
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'brewsci/bio'
tap 'heroku/brew'

# Install GUI apps
cask 'atom'
cask 'bbedit'
cask 'dropbox'
cask 'fantastical'
cask 'figtree'
cask 'gitkraken'
cask 'google-chrome'
cask 'launchbar'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'transmit'
cask 'vlc'
cask 'zoom'

# Install ruby formulae
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'

# Install python formulae
brew 'gcc'
brew 'python'
brew 'zmq'
brew 'cython'
brew 'numpy'
brew 'scipy'

# Install node formulae
brew 'npm'

# Install java formulae
brew 'java'

# Install science formulae
brew 'mafft'
brew 'fasttree'
# brew 'iqtree2' // M1 not supported

# Install latex formulae
cask 'mactex'
brew 'aspell'

# Install other formulae
brew 'awscli'
brew 'docker'
brew 'git-lfs'
brew 'heroku'
brew 'rethinkdb'
